Revit 2027 API
PipeFittingAndAccessoryData.FluidViscosity Property
 The fluid dynamic viscosity of the pipe fitting or pipe accessory, Units: (kg/(ft·s)).
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double FluidViscosity { get; }
Public ReadOnly Property FluidViscosity As Double
	Get
public:
property double FluidViscosity {
	double get ();
}
member FluidViscosity : float with get
Property Value
Double
See Also
Reference
PipeFittingAndAccessoryData Class
Autodesk.Revit.DB.Plumbing Namespace